#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_vpc.example: Refreshing state... [id=vpc-056119713e08dd6f0]
aws_s3_bucket.frontend: Refreshing state... [id=mmdev-test-frontend]
module.web_server.aws_security_group.default: Refreshing state... [id=sg-01f4f76e0610554c3]
aws_s3_bucket.alb_log: Refreshing state... [id=mmdev-test-alb-log]
aws_s3_bucket.records: Refreshing state... [id=mmdev-test-records]
module.web_server.aws_instance.default: Refreshing state... [id=i-0a812e35d2fa205e4]
module.http_sg.aws_security_group.default: Refreshing state... [id=sg-0a7dbd18c6285ca9f]
aws_subnet.private_0: Refreshing state... [id=subnet-09c6c3c2cc6909a17]
module.http_redirect_sg.aws_security_group.default: Refreshing state... [id=sg-0e82126dfda24ebc9]
aws_route_table.public: Refreshing state... [id=rtb-0ccee54b195c71376]
aws_subnet.public_0: Refreshing state... [id=subnet-0a41403ae5d308e70]
aws_internet_gateway.example: Refreshing state... [id=igw-0bea8ed4f3e2c7f3f]
aws_route_table.private_1: Refreshing state... [id=rtb-0e376e566b0bfd079]
aws_route_table.private_0: Refreshing state... [id=rtb-051852fe680a78177]
module.https_sg.aws_security_group.default: Refreshing state... [id=sg-0ee589928c50608a4]
aws_subnet.private_1: Refreshing state... [id=subnet-073ef9a8c35ec43c0]
aws_subnet.public_1: Refreshing state... [id=subnet-0d32a52e2808dafb3]
aws_eip.nat_gateway_0: Refreshing state... [id=eipalloc-0135ef28406752525]
aws_eip.nat_gateway_1: Refreshing state... [id=eipalloc-068bfbcc8ee13f582]
aws_route.public: Refreshing state... [id=r-rtb-0ccee54b195c713761080289494]
aws_route_table_association.private_0: Refreshing state... [id=rtbassoc-0dbae5e3cb32c202a]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-838302217]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1703109790]
aws_route_table_association.public_0: Refreshing state... [id=rtbassoc-0f5ddf96bd18400c9]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-951650053]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3658532139]
module.http_redirect_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2051229157]
module.http_redirect_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-672509324]
aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-03d8150914ecdec73]
aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-059ef70d0699d1053]
aws_nat_gateway.example_1: Refreshing state... [id=nat-0a66cc6930195e01a]
aws_nat_gateway.example_0: Refreshing state... [id=nat-0f3f206dbffce7621]
aws_route.private_1: Refreshing state... [id=r-rtb-0e376e566b0bfd0791080289494]
aws_route.private_0: Refreshing state... [id=r-rtb-051852fe680a781771080289494]
aws_s3_bucket_policy.alb_log: Refreshing state... [id=mmdev-test-alb-log]
aws_lb.example: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/fe1627fa3675da42]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:listener/app/example/fe1627fa3675da42/ad024ecbfeda05b7]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_eip.nat_gateway_0 has been deleted
  - resource "aws_eip" "nat_gateway_0" {
      - allocation_id        = "eipalloc-0135ef28406752525" -> null
      - association_id       = "eipassoc-045c9b95ff63ccce7" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0135ef28406752525" -> null
      - network_border_group = "ap-northeast-1" -> null
      - network_interface    = "eni-0ba72904e2d67f76e" -> null
      - private_dns          = "ip-10-0-1-199.ap-northeast-1.compute.internal" -> null
      - private_ip           = "10.0.1.199" -> null
      - public_dns           = "ec2-35-74-204-183.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip            = "35.74.204.183" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
      - vpc                  = true -> null
    }

  # aws_eip.nat_gateway_1 has been deleted
  - resource "aws_eip" "nat_gateway_1" {
      - allocation_id        = "eipalloc-068bfbcc8ee13f582" -> null
      - association_id       = "eipassoc-0e23b1085e6262ce8" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-068bfbcc8ee13f582" -> null
      - network_border_group = "ap-northeast-1" -> null
      - network_interface    = "eni-09d44ec422cb9344c" -> null
      - private_dns          = "ip-10-0-2-203.ap-northeast-1.compute.internal" -> null
      - private_ip           = "10.0.2.203" -> null
      - public_dns           = "ec2-52-194-4-114.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip            = "52.194.4.114" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
      - vpc                  = true -> null
    }

  # aws_lb.example has changed
  ~ resource "aws_lb" "example" {
        id                         = "arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/fe1627fa3675da42"
        name                       = "example"
      + tags                       = {}
        # (17 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # aws_lb_listener.http has been deleted
  - resource "aws_lb_listener" "http" {
      - arn               = "arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:listener/app/example/fe1627fa3675da42/ad024ecbfeda05b7" -> null
      - id                = "arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:listener/app/example/fe1627fa3675da42/ad024ecbfeda05b7" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/fe1627fa3675da42" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags_all          = {} -> null

      - default_action {
          - order = 1 -> null
          - type  = "fixed-response" -> null

          - fixed_response {
              - content_type = "text/plain" -> null
              - message_body = "これはHTTPです" -> null
              - status_code  = "200" -> null
            }
        }
    }

  # aws_nat_gateway.example_0 has been deleted
  - resource "aws_nat_gateway" "example_0" {
      - allocation_id        = "eipalloc-0135ef28406752525" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-0f3f206dbffce7621" -> null
      - network_interface_id = "eni-0ba72904e2d67f76e" -> null
      - private_ip           = "10.0.1.199" -> null
      - public_ip            = "35.74.204.183" -> null
      - subnet_id            = "subnet-0a41403ae5d308e70" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
    }

  # aws_nat_gateway.example_1 has been deleted
  - resource "aws_nat_gateway" "example_1" {
      - allocation_id        = "eipalloc-068bfbcc8ee13f582" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-0a66cc6930195e01a" -> null
      - network_interface_id = "eni-09d44ec422cb9344c" -> null
      - private_ip           = "10.0.2.203" -> null
      - public_ip            = "52.194.4.114" -> null
      - subnet_id            = "subnet-0d32a52e2808dafb3" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
    }

  # aws_route.private_0 has been deleted
  - resource "aws_route" "private_0" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-051852fe680a781771080289494" -> null
      - nat_gateway_id         = "nat-0f3f206dbffce7621" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-051852fe680a78177" -> null
      - state                  = "active" -> null
    }

  # aws_route.private_1 has been deleted
  - resource "aws_route" "private_1" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0e376e566b0bfd0791080289494" -> null
      - nat_gateway_id         = "nat-0a66cc6930195e01a" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0e376e566b0bfd079" -> null
      - state                  = "active" -> null
    }

  # aws_route.public has been deleted
  - resource "aws_route" "public" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-0bea8ed4f3e2c7f3f" -> null
      - id                     = "r-rtb-0ccee54b195c713761080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0ccee54b195c71376" -> null
      - state                  = "active" -> null
    }

  # aws_route_table.private_0 has been deleted
  - resource "aws_route_table" "private_0" {
      - arn              = "arn:aws:ec2:ap-northeast-1:138767642386:route-table/rtb-051852fe680a78177" -> null
      - id               = "rtb-051852fe680a78177" -> null
      - owner_id         = "138767642386" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0f3f206dbffce7621"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
      - vpc_id           = "vpc-056119713e08dd6f0" -> null
    }

  # aws_route_table.private_1 has been deleted
  - resource "aws_route_table" "private_1" {
      - arn              = "arn:aws:ec2:ap-northeast-1:138767642386:route-table/rtb-0e376e566b0bfd079" -> null
      - id               = "rtb-0e376e566b0bfd079" -> null
      - owner_id         = "138767642386" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0a66cc6930195e01a"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
      - vpc_id           = "vpc-056119713e08dd6f0" -> null
    }

  # aws_route_table.public has been deleted
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:ap-northeast-1:138767642386:route-table/rtb-0ccee54b195c71376" -> null
      - id               = "rtb-0ccee54b195c71376" -> null
      - owner_id         = "138767642386" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0bea8ed4f3e2c7f3f"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
      - vpc_id           = "vpc-056119713e08dd6f0" -> null
    }

  # aws_route_table_association.private_0 has been deleted
  - resource "aws_route_table_association" "private_0" {
      - id             = "rtbassoc-0dbae5e3cb32c202a" -> null
      - route_table_id = "rtb-051852fe680a78177" -> null
      - subnet_id      = "subnet-09c6c3c2cc6909a17" -> null
    }

  # aws_route_table_association.private_1 has been deleted
  - resource "aws_route_table_association" "private_1" {
      - id             = "rtbassoc-03d8150914ecdec73" -> null
      - route_table_id = "rtb-0e376e566b0bfd079" -> null
      - subnet_id      = "subnet-073ef9a8c35ec43c0" -> null
    }

  # aws_route_table_association.public_0 has been deleted
  - resource "aws_route_table_association" "public_0" {
      - id             = "rtbassoc-0f5ddf96bd18400c9" -> null
      - route_table_id = "rtb-0ccee54b195c71376" -> null
      - subnet_id      = "subnet-0a41403ae5d308e70" -> null
    }

  # aws_route_table_association.public_1 has been deleted
  - resource "aws_route_table_association" "public_1" {
      - id             = "rtbassoc-059ef70d0699d1053" -> null
      - route_table_id = "rtb-0ccee54b195c71376" -> null
      - subnet_id      = "subnet-0d32a52e2808dafb3" -> null
    }

  # aws_s3_bucket.frontend has been deleted
  - resource "aws_s3_bucket" "frontend" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::mmdev-test-frontend" -> null
      - bucket                      = "mmdev-test-frontend" -> null
      - bucket_domain_name          = "mmdev-test-frontend.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "mmdev-test-frontend.s3.ap-northeast-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2M4EHUR26P7ZW" -> null
      - id                          = "mmdev-test-frontend" -> null
      - region                      = "ap-northeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.records has been deleted
  - resource "aws_s3_bucket" "records" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::mmdev-test-records" -> null
      - bucket                      = "mmdev-test-records" -> null
      - bucket_domain_name          = "mmdev-test-records.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "mmdev-test-records.s3.ap-northeast-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2M4EHUR26P7ZW" -> null
      - id                          = "mmdev-test-records" -> null
      - region                      = "ap-northeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "tf-s3-lifecycle-20220209082123220600000001" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 1 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_policy.alb_log has changed
  ~ resource "aws_s3_bucket_policy" "alb_log" {
        id     = "mmdev-test-alb-log"
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "582318560864"
                        }
                      - Resource  = "arn:aws:s3:::mmdev-test-alb-log/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
        # (1 unchanged attribute hidden)
    }

  # aws_subnet.private_0 has been deleted
  - resource "aws_subnet" "private_0" {
      - arn                                            = "arn:aws:ec2:ap-northeast-1:138767642386:subnet/subnet-09c6c3c2cc6909a17" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-northeast-1a" -> null
      - availability_zone_id                           = "apne1-az4" -> null
      - cidr_block                                     = "10.0.65.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-09c6c3c2cc6909a17" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "138767642386" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-056119713e08dd6f0" -> null
    }

  # aws_subnet.private_1 has been deleted
  - resource "aws_subnet" "private_1" {
      - arn                                            = "arn:aws:ec2:ap-northeast-1:138767642386:subnet/subnet-073ef9a8c35ec43c0" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-northeast-1c" -> null
      - availability_zone_id                           = "apne1-az1" -> null
      - cidr_block                                     = "10.0.66.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-073ef9a8c35ec43c0" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "138767642386" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-056119713e08dd6f0" -> null
    }

  # module.http_redirect_sg.aws_security_group.default has changed
  ~ resource "aws_security_group" "default" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ]
        id                     = "sg-0e82126dfda24ebc9"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
        ]
        name                   = "http-redirect-sg"
        tags                   = {}
        # (6 unchanged attributes hidden)
    }

  # module.http_redirect_sg.aws_security_group_rule.egress has been deleted
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-2051229157" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-0e82126dfda24ebc9" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.http_redirect_sg.aws_security_group_rule.ingress has been deleted
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 8080 -> null
      - id                = "sgrule-672509324" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0e82126dfda24ebc9" -> null
      - self              = false -> null
      - to_port           = 8080 -> null
      - type              = "ingress" -> null
    }

  # module.http_sg.aws_security_group.default has changed
  ~ resource "aws_security_group" "default" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ]
        id                     = "sg-0a7dbd18c6285ca9f"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ]
        name                   = "http-sg"
        tags                   = {}
        # (6 unchanged attributes hidden)
    }

  # module.http_sg.aws_security_group_rule.egress has been deleted
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-951650053" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-0a7dbd18c6285ca9f" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.http_sg.aws_security_group_rule.ingress has been deleted
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 80 -> null
      - id                = "sgrule-3658532139" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0a7dbd18c6285ca9f" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

  # module.https_sg.aws_security_group.default has changed
  ~ resource "aws_security_group" "default" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ]
        id                     = "sg-0ee589928c50608a4"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ]
        name                   = "https-sg"
        tags                   = {}
        # (6 unchanged attributes hidden)
    }

  # module.https_sg.aws_security_group_rule.egress has been deleted
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-1703109790" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-0ee589928c50608a4" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.https_sg.aws_security_group_rule.ingress has been deleted
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 443 -> null
      - id                = "sgrule-838302217" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0ee589928c50608a4" -> null
      - self              = false -> null
      - to_port           = 443 -> null
      - type              = "ingress" -> null
    }

  # module.web_server.aws_instance.default has been deleted
  - resource "aws_instance" "default" {
      - ami                                  = "ami-03d79d440297083e3" -> null
      - arn                                  = "arn:aws:ec2:ap-northeast-1:138767642386:instance/i-0a812e35d2fa205e4" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-northeast-1d" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0a812e35d2fa205e4" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0e01347bc0862dfb5" -> null
      - private_dns                          = "ip-172-31-25-48.ap-northeast-1.compute.internal" -> null
      - private_ip                           = "172.31.25.48" -> null
      - public_dns                           = "ec2-35-72-32-169.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip                            = "35.72.32.169" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "ec2",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-03b8052d51eacbf76" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
      - tenancy                              = "default" -> null
      - user_data                            = "e9e2123bc6ec4bb50f9c01abc81d73a9ec5fedc8" -> null
      - vpc_security_group_ids               = [
          - "sg-01f4f76e0610554c3",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-01eded699985f1165" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.web_server.aws_security_group.default has been deleted
  - resource "aws_security_group" "default" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:138767642386:security-group/sg-01f4f76e0610554c3" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-01f4f76e0610554c3" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "ec2" -> null
      - owner_id               = "138767642386" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0ca3595b629ed773b" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eip.nat_gateway_0 will be created
  + resource "aws_eip" "nat_gateway_0" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_eip.nat_gateway_1 will be created
  + resource "aws_eip" "nat_gateway_1" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_lb.example will be updated in-place
  ~ resource "aws_lb" "example" {
      ~ enable_deletion_protection = true -> false
        id                         = "arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/fe1627fa3675da42"
        name                       = "example"
        tags                       = {}
        # (16 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/fe1627fa3675da42"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "これはHTTPです"
              + status_code  = "200"
            }
        }
    }

  # aws_nat_gateway.example_0 will be created
  + resource "aws_nat_gateway" "example_0" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0a41403ae5d308e70"
      + tags_all             = (known after apply)
    }

  # aws_nat_gateway.example_1 will be created
  + resource "aws_nat_gateway" "example_1" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0d32a52e2808dafb3"
      + tags_all             = (known after apply)
    }

  # aws_route.private_0 will be created
  + resource "aws_route" "private_0" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_1 will be created
  + resource "aws_route" "private_1" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = "igw-0bea8ed4f3e2c7f3f"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private_0 will be created
  + resource "aws_route_table" "private_0" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-056119713e08dd6f0"
    }

  # aws_route_table.private_1 will be created
  + resource "aws_route_table" "private_1" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-056119713e08dd6f0"
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-056119713e08dd6f0"
    }

  # aws_route_table_association.private_0 will be created
  + resource "aws_route_table_association" "private_0" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_1 will be created
  + resource "aws_route_table_association" "private_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_0 will be created
  + resource "aws_route_table_association" "public_0" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0a41403ae5d308e70"
    }

  # aws_route_table_association.public_1 will be created
  + resource "aws_route_table_association" "public_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0d32a52e2808dafb3"
    }

  # aws_s3_bucket.frontend will be created
  + resource "aws_s3_bucket" "frontend" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mmdev-test-frontend"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_s3_bucket.records will be created
  + resource "aws_s3_bucket" "records" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mmdev-test-records"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 1
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_policy.alb_log will be updated in-place
  ~ resource "aws_s3_bucket_policy" "alb_log" {
        id     = "mmdev-test-alb-log"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "582318560864"
                        }
                      + Resource  = "arn:aws:s3:::mmdev-test-alb-log/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_subnet.private_0 will be created
  + resource "aws_subnet" "private_0" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.65.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = "vpc-056119713e08dd6f0"
    }

  # aws_subnet.private_1 will be created
  + resource "aws_subnet" "private_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.66.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = "vpc-056119713e08dd6f0"
    }

  # module.http_redirect_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = "sg-0e82126dfda24ebc9"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.http_redirect_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0e82126dfda24ebc9"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.http_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = "sg-0a7dbd18c6285ca9f"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.http_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0a7dbd18c6285ca9f"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.https_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = "sg-0ee589928c50608a4"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.https_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0ee589928c50608a4"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.web_server.aws_instance.default will be created
  + resource "aws_instance" "default" {
      + ami                                  = "ami-03d79d440297083e3"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "e9e2123bc6ec4bb50f9c01abc81d73a9ec5fedc8"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.web_server.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ec2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 27 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ public_dns = "ec2-35-72-32-169.ap-northeast-1.compute.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @mmdev110, Action: `pull_request`*